Revit 2027 API
AnalyticalToPhysicalAssociationManager.HasAssociation Method
 Verifies if the element has already defined an association.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasAssociation(
	ElementId id
)
Public Function HasAssociation (
	id As ElementId
) As Boolean
public:
bool HasAssociation(
	ElementId^ id
)
member HasAssociation :
        id : ElementId -> bool
Parameters
id ElementId
 Id of the element to check.
Return Value
Boolean
 Returns true if an association has been found, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalToPhysicalAssociationManager Class
Autodesk.Revit.DB.Structure Namespace